In [2]:
import pandas as pd
from scipy.stats import ttest_1samp

In [3]:
ls

Cost of 1GB of Data.xlsx
Inferential statistics - T-test & P-value.xlsx
Lab | Inferential statistics - T-test & P-value.ipynb
machinetxt.txt
student_gpa.txt
~$Inferential statistics - T-test & P-value.xlsx

In [5]:
df=pd.read_excel('Inferential statistics - T-test & P-value.xlsx', sheet_name='Sheet1')

In [6]:
df

   New machine      Old machine
0         42.1             42.7
1         41.0             43.6
2         41.3             43.8
3         41.8             43.3
4         42.4             42.5
5         42.8             43.5
6         43.2             43.1
7         42.3             41.7
8         41.8             44.0
9         42.7             44.1

In [7]:
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_').str.replace('(', '').str.replace(')', '')

<ipython-input-7-c24f79c43405>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_').str.replace('(', '').str.replace(')', '')

In [8]:
df.describe()

       new_machine  old_machine
count    10.000000    10.000000
mean     42.140000    43.230000
std       0.683455     0.749889
min      41.000000    41.700000
25%      41.800000    42.800000
50%      42.200000    43.400000
75%      42.625000    43.750000
max      43.200000    44.100000

In [9]:
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_').str.replace('(', '').str.replace(')', '')

<ipython-input-9-c24f79c43405>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_').str.replace('(', '').str.replace(')', '')

In [10]:
df.describe()

       new_machine  old_machine
count    10.000000    10.000000
mean     42.140000    43.230000
std       0.683455     0.749889
min      41.000000    41.700000
25%      41.800000    42.800000
50%      42.200000    43.400000
75%      42.625000    43.750000
max      43.200000    44.100000

In [11]:
new_machine_list = df["new_machine"].tolist()

In [12]:
new_machine_list

[42.1, 41.0, 41.3, 41.8, 42.4, 42.8, 43.2, 42.3, 41.8, 42.7]

In [13]:
old_machine_list = df["old_machine"].tolist()

In [14]:
old_machine_list

[42.7, 43.6, 43.8, 43.3, 42.5, 43.5, 43.1, 41.7, 44.0, 44.1]

In [15]:
import scipy.stats as stats

In [16]:
stats.ttest_ind(a=new_machine_list, b=old_machine_list, equal_var=True)

Ttest_indResult(statistic=-3.3972307061176026, pvalue=0.0032111425007745158)